from lab1.task1.logger import logger

@logger
def my_func(*args, **kwargs) -> None:
    """
    Простая тестовая функция для демонстрации работы декоратора logger.
    """
    pass

if __name__ == '__main__':
    """
    Точка входа в программу.

    Вызывает функцию my_func с различными аргументами для демонстрации
    работы декоратора logger. Декоратор должен вывести:
    - Имя функции (my_func)
    - Переданные аргументы (позиционные: 1,2,3 и именованные: b=3, n=8)
    - Время выполнения функции
    """

    my_func(1,2,3, b=3, n=8)

    my_func()

    my_func(1,2,3)

    my_func(a=1, b=2)